// Базовий Міксін:
// Створіть базовий міксін, який додає декілька методів або даних у компонент.

// Міксін для Життєвих Циклів:
// Створіть міксін, який включає хуки життєвого циклу для логування повідомлень при створенні та знищенні компоненту.

// Глобальний Міксін:
// Створіть глобальний міксін і додайте його глобально в вашому основному файлі main.js або main.ts.


export const LogMixin = {
  
  created() {
    console.log(`Component ${this.$options.name} created`);
  },
  unmounted () {
    console.log(`Component ${this.$options.name} unmounted`);
  }
};